In [15]:
import pandas as pd

In [16]:
data_file = "purchase_data.csv"

In [17]:
data_file_pd = pd.read_csv(data_file)

In [18]:
data_file_pd.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [19]:
#Player Count
#total number of players
total_number_of_players = (data_file_pd["SN"].nunique())
total_number_of_players

576

In [20]:
#Purchasing Analysis(Total)
#Number of Unique Items
number_of_unique_items = data_file_pd["Item ID"].nunique()
number_of_unique_items

183

In [21]:
#Average Purchase Price
average_purchase_price = data_file_pd["Price"].mean()
average_purchase_price

3.050987179487176

In [22]:
#Total Number of Purchases
total_number_of_purchases = data_file_pd["Purchase ID"].count()
total_number_of_purchases

780

In [23]:
#Total Revenue
total_revenue = data_file_pd["Price"].sum()
total_revenue

2379.77

In [27]:
#Gender Demographics
#Male Count
data_file_male = data_file_pd.loc[data_file_pd['Gender'] == 'Male']
data_file_male_count = data_file_male['SN'].nunique()
data_file_male_count

484

In [32]:
#Female Count
data_file_female = data_file_pd.loc[data_file_pd['Gender'] == 'Female']
data_file_female_count = data_file_female['SN'].nunique()
data_file_female_count

81

In [34]:
#Other Count
data_file_other = data_file_pd.loc[data_file_pd['Gender'] == 'Other / Non-Disclosed']
data_file_other_count = data_file_other['SN'].nunique()
data_file_other_count

11

In [35]:
#Percentage of Female Players
percentage_female_players = (data_file_female_count/total_number_of_players ) * 100
percentage_female_players

14.0625

In [36]:
#Percentage of Male Players
percentage_male_players = (data_file_male_count/total_number_of_players ) * 100
percentage_male_players

84.02777777777779

In [37]:
#Percentage of Other Players
percentage_other_players = (data_file_other_count/total_number_of_players ) * 100
percentage_other_players

1.9097222222222223

In [ ]:
#Purchasing Analysis(Gender)
#Male Purchase Count
male_purchase_count = data_file_male['Purchase ID'].count()
male_purchase_count

In [38]:
#Female Purchase Count
female_purchase_count = data_file_female['Purchase ID'].count()
female_purchase_count

113

In [39]:
#Other Purchase Count
other_purchase_count = data_file_other['Purchase ID'].count()
other_purchase_count

15

In [40]:
#Male Average Purchase
male_average_purchase = data_file_male['Price'].mean()
male_average_purchase

3.0178527607361953

In [41]:
#Female Average Purchase
female_average_purchase = data_file_female['Price'].mean()
female_average_purchase

3.203008849557519

In [42]:
#Other Average Purchase
other_average_purchase = data_file_other['Price'].mean()
other_average_purchase

3.3460000000000005

In [43]:
#Male Total Purchase
male_total_purchase = data_file_male['Price'].sum()
male_total_purchase

1967.64

In [44]:
#Female Total Purchase
female_total_purchase = data_file_female['Price'].sum()
female_total_purchase

361.94

In [45]:
#Other Total Purchase
other_total_purchase = data_file_other['Price'].sum()
other_total_purchase

50.19

In [46]:
#Average Purchase Total Per Person by Gender
data_file_gender_person = data_file_pd.groupby(['Gender','SN'])
data_file_gender_person_df = pd.DataFrame(data_file_gender_person['Price'].mean())
data_file_gender_person_df

                                     Price
Gender                SN
Female                Adastirin33    4.480
                      Aerithllora36  4.320
                      Aethedru70     3.540
                      Aidain51       3.450
                      Aiduesu86      4.480
...                                    ...
Other / Non-Disclosed Lirtim36       1.330
                      Maluncil97     2.640
                      Rairith81      2.220
                      Siarithria38   3.455
                      Sundim98       4.750

[576 rows x 1 columns]

In [47]:
#Age Demographics
#Creating bins and labels
bins = [4,8,12,16,20,24,28,32,36,40,44,48]

age_range_labels = ["5 to 8","9 to 12","13 to 16","17 to 20","21 to 24","25 to 28","29 to 32","33 to 36","37 to 40","41 to 44","45 to 48"]

In [48]:
pd.cut(data_file_pd["Age"],bins,age_range_labels).value_counts()

(20, 24]    266
(16, 20]    170
(24, 28]     88
(12, 16]     71
(28, 32]     63
(32, 36]     42
(36, 40]     28
(8, 12]      28
(4, 8]       17
(40, 44]      6
(44, 48]      1
Name: Age, dtype: int64

In [49]:
#adding age range field to data frame
data_file_pd["Age Range"] = pd.cut(data_file_pd["Age"],bins,age_range_labels)
data_file_pd

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Range
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,"(16, 20]"
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,"(36, 40]"
2,2,Ithergue48,24,Male,92,Final Critic,4.88,"(20, 24]"
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,"(20, 24]"
4,4,Iskosia90,23,Male,131,Fury,1.44,"(20, 24]"
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,"(20, 24]"
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,"(20, 24]"
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,"(16, 20]"
778,778,Sisur91,7,Male,101,Final Critic,4.19,"(4, 8]"
779,779,Ennrian78,24,Male,50,Dawn,4.60,"(20, 24]"

In [ ]:
data_file_pd_2 = data_file_pd.copy()
data_file_pd_2

In [50]:
#Purchase Count by Age Range
data_file_grouped = data_file_pd.groupby('Age Range')
purchase_count_agerange = data_file_grouped['Purchase ID'].count()
purchase_count_agerange

Age Range
(4, 8]       17
(8, 12]      28
(12, 16]     71
(16, 20]    170
(20, 24]    266
(24, 28]     88
(28, 32]     63
(32, 36]     42
(36, 40]     28
(40, 44]      6
(44, 48]      1
Name: Purchase ID, dtype: int64

In [51]:
# Average Purchase Price by Age Range
purchase_avgprice_agerange = data_file_grouped['Price'].mean()
purchase_avgprice_agerange

Age Range
(4, 8]      3.462353
(8, 12]     3.024643
(12, 16]    2.993944
(16, 20]    3.123529
(20, 24]    3.006541
(24, 28]    2.929205
(28, 32]    3.052222
(32, 36]    2.895952
(36, 40]    3.560357
(40, 44]    3.305000
(44, 48]    1.700000
Name: Price, dtype: float64

In [52]:
#Total Purchase Value by Age Range
purchase_total_agerange = data_file_grouped['Price'].sum()
purchase_total_agerange

Age Range
(4, 8]       58.86
(8, 12]      84.69
(12, 16]    212.57
(16, 20]    531.00
(20, 24]    799.74
(24, 28]    257.77
(28, 32]    192.29
(32, 36]    121.63
(36, 40]     99.69
(40, 44]     19.83
(44, 48]      1.70
Name: Price, dtype: float64

In [55]:
#Average Purchase Total Per Person by Age Group
average_purchasetotal_person_byagegroup = data_file_pd.groupby(['Age Range','SN'])
average_purchasetotal_person_byagegroup_pd = pd.DataFrame(average_purchasetotal_person_byagegroup["Price"].mean())
average_purchasetotal_person_byagegroup_pd = average_purchasetotal_person_byagegroup_pd.dropna(how='any')
average_purchasetotal_person_byagegroup_pd.head(50)

                              Price
Age Range SN
(4, 8]    Anallorgue57     2.850000
          Chadjask77       4.930000
          Chanossast57     4.320000
          Eusri44          3.090000
          Frichossala54    3.080000
          Haillyrgue51     3.166667
          Heudai45         3.470000
          Ilmol66          3.085000
          Quilassa66       4.230000
          Seuthep89        2.050000
          Sisur91          4.190000
          Sondossa69       4.480000
          Tyeurith29       3.650000
(8, 12]   Aeralria27       4.090000
          Aillyrin83       2.890000
          Eosurdru76       1.790000
          Eurithphos97     2.275000
          Iana95           3.100000
          Iarilis73        2.745000
          Ilastilis78      1.970000
          Ililsan66        2.850000
          Jiskjask80       4.190000
          Lassassasda30    3.540000
          Lirtirra81       1.560000
          Lirtossa84       1.620000
          Lisico81         4.190000
          Lisjaskan36      3.360000
          Quaecjask96      4.400000
          Raesty92         2.910000
          Reulae52         4.180000
          Siana77          1.970000
          Sidap51          4.240000
          Sondadar26       3.235000
          Zhisrisu83       3.945000
(12, 16]  Adairialis76     2.280000
          Aerillorin70     3.330000
          Aerithnucal56    4.400000
          Aerithriaphos46  2.180000
          Chamadar79       3.140000
          Chamimla85       2.100000
          Chamjaskya75     2.840000
          Chanilsasda38    2.520000
          Chanirrasta87    4.940000
          Eodaisu60        3.940000
          Eoral49          4.350000
          Eryon48          1.100000
          Ethralista69     2.220000
          Eudanu32         2.850000
          Frichilsa31      1.440000
          Frichosia58      4.430000

In [60]:
# Identify the top 5 spenders
spenders = data_file_pd.groupby('SN')
top_spenders = (spenders['Price'].sum())
top_spenders_count = (spenders['Price'].count())
top_spenders_avg = (spenders['Price'].mean())
top_spenders_df = pd.DataFrame(top_spenders).sort_values("Price",ascending=False)
top_spenders_df["Purchase Count"] = top_spenders_count
top_spenders_df["Average Purchase Price"] = top_spenders_avg
top_spenders_df_out = top_spenders_df[['Purchase Count','Average Purchase Price', 'Price']]
top_spenders_df_final = top_spenders_df_out.iloc[:5,:]
top_spenders_df_final = top_spenders_df_final.rename(columns={'Price':'Total Purchase Value'})
top_spenders_df_final

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [61]:
# Most Popular Items by Purchase Count
items = data_file_pd.groupby(['Item ID','Item Name','Price'])
items_purchase_count = items['SN'].count()
item_total_purchase = items['Price'].sum()
top_items_df = pd.DataFrame(items_purchase_count).sort_values("SN",ascending=False)
top_items_df["Total Purchase Value"] = item_total_purchase
top_items_df_out = top_items_df.rename(columns={'SN':'Purchase Count'})
top_items_df_out=top_items_df_out.iloc[:5,:]
top_items_df_out

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
145,Fiery Glass Crusader,4.58,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
82,Nirvana,4.90,9,44.10
19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16

In [62]:
# Most Popular Items by Purchase Value
purchase_value = data_file_pd.groupby(['Item ID'])
items_purchase_total = purchase_value['Price'].sum()
items_purchase_count = purchase_value['SN'].count()
top_totalpurchase_df = pd.DataFrame(purchase_value)
top_totalpurchase_df['Total Purchase Value'] = items_purchase_total
top_totalpurchase_df['Purchase_Count']= items_purchase_count
top_totalpurchase_df.sort_values("Total Purchase Value",ascending=False)
top_totalpurchase_df_out=top_items_df_out.iloc[:5,:]
top_totalpurchase_df_out

,,,Purchase Count,Total Purchase Value
Item ID,Item Name,Price,,
178,"Oathbreaker, Last Hope of the Breaking Storm",4.23,12,50.76
145,Fiery Glass Crusader,4.58,9,41.22
108,"Extraction, Quickblade Of Trembling Hands",3.53,9,31.77
82,Nirvana,4.90,9,44.10
19,"Pursuit, Cudgel of Necromancy",1.02,8,8.16